williams-one/stm32-lvgl-c/hal_is25lp032d/is25lp032d.c
// /**
//   ******************************************************************************
//   * @file    mx66uw1g45g.c
//   * @modify  MCD Application Team
//   * @brief   This file provides the MX66UW1G45G XSPI drivers.
//   ******************************************************************************
//   * @attention
//   *
//   * Copyright (c) 2023 STMicroelectronics.
//   * All rights reserved.
//   *
//   * This software is licensed under terms that can be found in the LICENSE file
//   * in the root directory of this software component.
//   * If no LICENSE file comes with this software, it is provided AS-IS.
//   *
//   ******************************************************************************
//     * MX66UW1G45G action :
//   *   STR Octal IO protocol (SOPI) and DTR Octal IO protocol (DOPI) bits of
//   *   Configuration Register 2 :
//   *     DOPI = 1 and SOPI = 0: Operates in DTR Octal IO protocol (accepts 8-8-8 commands)
//   *     DOPI = 0 and SOPI = 1: Operates in STR Octal IO protocol (accepts 8-8-8 commands)
//   *     DOPI = 0 and SOPI = 0: Operates in Single IO protocol (accepts 1-1-1 commands)
//   *   Enter SOPI mode by configuring DOPI = 0 and SOPI = 1 in CR2-Addr0
//   *   Exit SOPI mode by configuring DOPI = 0 and SOPI = 0 in CR2-Addr0
//   *   Enter DOPI mode by configuring DOPI = 1 and SOPI = 0 in CR2-Addr0
//   *   Exit DOPI mode by configuring DOPI = 0 and SOPI = 0 in CR2-Addr0
//   *
//   *   Memory commands support STR(Single Transfer Rate) &
//   *   DTR(Double Transfer Rate) modes in OPI
//   *
//   *   Memory commands support STR(Single Transfer Rate) &
//   *   DTR(Double Transfer Rate) modes in SPI
//   *
//   ******************************************************************************
//   */

// /* Includes ------------------------------------------------------------------*/
// #include <hal_is25lp032d/mx66uw1g45g.h>

// /** @addtogroup BSP
//   * @{
//   */

// /** @addtogroup Components
//   * @{
//   */

// /** @defgroup MX66UW1G45G MX66UW1G45G
//   * @{
//   */

// /** @defgroup MX66UW1G45G_Exported_Functions MX66UW1G45G Exported Functions
//   * @{
//   */

// /**
//   * @brief  Get Flash information
//   * @param  pInfo pointer to information structure
//   * @retval error status
//   */
// int32_t MX66UW1G45G_GetFlashInfo(MX66UW1G45G_Info_t *pInfo)
// {
//   /* Configure the structure with the memory configuration */
//   pInfo->FlashSize = MX66UW1G45G_FLASH_SIZE;
//   pInfo->EraseSectorSize = MX66UW1G45G_BLOCK_64K;
//   pInfo->EraseSectorsNumber = (MX66UW1G45G_FLASH_SIZE / MX66UW1G45G_BLOCK_64K);
//   pInfo->EraseSubSectorSize = MX66UW1G45G_BLOCK_4K;
//   pInfo->EraseSubSectorNumber = (MX66UW1G45G_FLASH_SIZE / MX66UW1G45G_BLOCK_4K);
//   pInfo->EraseSubSector1Size = MX66UW1G45G_BLOCK_4K;
//   pInfo->EraseSubSector1Number = (MX66UW1G45G_FLASH_SIZE / MX66UW1G45G_BLOCK_4K);
//   pInfo->ProgPageSize = MX66UW1G45G_PAGE_SIZE;
//   pInfo->ProgPagesNumber = (MX66UW1G45G_FLASH_SIZE / MX66UW1G45G_PAGE_SIZE);

//   return MX66UW1G45G_OK;
// };

// /**
//   * @brief  Polling WIP(Write In Progress) bit become to 0
//   *         SPI/OPI;
//   * @param  Ctx Component object pointer
//   * @param  Mode Interface mode
//   * @param  Rate Transfer rate
//   * @retval error status
//   */
// int32_t MX66UW1G45G_AutoPollingMemReady(XSPI_HandleTypeDef *Ctx, MX66UW1G45G_Interface_t Mode,
//                                         MX66UW1G45G_Transfer_t Rate)
// {
//   XSPI_RegularCmdTypeDef s_command = {0};
//   XSPI_AutoPollingTypeDef s_config = {0};

//   /* SPI mode and DTR transfer not supported by memory */
//   if ((Mode == MX66UW1G45G_SPI_MODE) && (Rate == MX66UW1G45G_DTR_TRANSFER))
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   /* Configure automatic polling mode to wait for memory ready */
//   s_command.OperationType = HAL_XSPI_OPTYPE_COMMON_CFG;
//   s_command.InstructionMode = (Mode == MX66UW1G45G_SPI_MODE)
//                                   ? HAL_XSPI_INSTRUCTION_1_LINE
//                                   : HAL_XSPI_INSTRUCTION_8_LINES;
//   s_command.InstructionDTRMode = (Rate == MX66UW1G45G_DTR_TRANSFER)
//                                      ? HAL_XSPI_INSTRUCTION_DTR_ENABLE
//                                      : HAL_XSPI_INSTRUCTION_DTR_DISABLE;
//   s_command.InstructionWidth = (Mode == MX66UW1G45G_SPI_MODE)
//                                    ? HAL_XSPI_INSTRUCTION_8_BITS
//                                    : HAL_XSPI_INSTRUCTION_16_BITS;
//   s_command.Instruction = (Mode == MX66UW1G45G_SPI_MODE)
//                               ? MX66UW1G45G_READ_STATUS_REG_CMD
//                               : MX66UW1G45G_OCTA_READ_STATUS_REG_CMD;
//   s_command.AddressMode = (Mode == MX66UW1G45G_SPI_MODE) ? HAL_XSPI_ADDRESS_NONE : HAL_XSPI_ADDRESS_8_LINES;
//   s_command.AddressDTRMode = (Rate == MX66UW1G45G_DTR_TRANSFER)
//                                  ? HAL_XSPI_ADDRESS_DTR_ENABLE
//                                  : HAL_XSPI_ADDRESS_DTR_DISABLE;
//   s_command.AddressWidth = HAL_XSPI_ADDRESS_32_BITS;
//   s_command.Address = 0U;
//   s_command.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
//   s_command.DataMode = (Mode == MX66UW1G45G_SPI_MODE) ? HAL_XSPI_DATA_1_LINE : HAL_XSPI_DATA_8_LINES;
//   s_command.DataDTRMode = (Rate == MX66UW1G45G_DTR_TRANSFER)
//                               ? HAL_XSPI_DATA_DTR_ENABLE
//                               : HAL_XSPI_DATA_DTR_DISABLE;
//   s_command.DummyCycles = (Mode == MX66UW1G45G_SPI_MODE)
//                               ? 0U
//                               : ((Rate == MX66UW1G45G_DTR_TRANSFER)
//                                      ? DUMMY_CYCLES_REG_OCTAL_DTR
//                                      : DUMMY_CYCLES_REG_OCTAL);
//   s_command.DataLength = (Rate == MX66UW1G45G_DTR_TRANSFER) ? 2U : 1U;
//   s_command.DQSMode = (Rate == MX66UW1G45G_DTR_TRANSFER) ? HAL_XSPI_DQS_ENABLE : HAL_XSPI_DQS_DISABLE;
//  #if defined (XSPI_CCR_SIOO)
//   s_command.SIOOMode            = HAL_XSPI_SIOO_INST_EVERY_CMD;
//  #endif

//   s_config.MatchValue = 0U;
//   s_config.MatchMask = MX66UW1G45G_SR_WIP;
//   s_config.MatchMode = HAL_XSPI_MATCH_MODE_AND;
//   s_config.IntervalTime = MX66UW1G45G_AUTOPOLLING_INTERVAL_TIME;
//   s_config.AutomaticStop = HAL_XSPI_AUTOMATIC_STOP_ENABLE;

