williams-one/stm32-lvgl-c/hal_is25lp032d/is25lp032d.c
//   if (HAL_XSPI_Command(Ctx, &s_command, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   if (HAL_XSPI_AutoPolling(Ctx, &s_config, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   return MX66UW1G45G_OK;
// }

// /* Read/Write Array Commands (3/4 Byte Address Command Set) *********************/
// /**
//   * @brief  Reads an amount of data from the XSPI memory on STR mode.
//   *         SPI/OPI; 1-1-1/8-8-8
//   * @param  Ctx Component object pointer
//   * @param  Mode Interface mode
//   * @param  AddressWidth Address size
//   * @param  pData Pointer to data to be read
//   * @param  ReadAddr Read start address
//   * @param  Size Size of data to read
//   * @retval XSPI memory status
//   */
// int32_t MX66UW1G45G_ReadSTR(XSPI_HandleTypeDef *Ctx, MX66UW1G45G_Interface_t Mode,
//                             MX66UW1G45G_AddressWidth_t AddressWidth, uint8_t *pData, uint32_t ReadAddr, uint32_t Size)
// {
//   XSPI_RegularCmdTypeDef s_command = {0};

//   /* OPI mode and 3-bytes address size not supported by memory */
//   if ((Mode == MX66UW1G45G_OPI_MODE) && (AddressWidth == MX66UW1G45G_3BYTES_SIZE))
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   /* Initialize the read command */
//   s_command.OperationType = HAL_XSPI_OPTYPE_COMMON_CFG;
//   s_command.InstructionMode = (Mode == MX66UW1G45G_SPI_MODE)
//                                   ? HAL_XSPI_INSTRUCTION_1_LINE
//                                   : HAL_XSPI_INSTRUCTION_8_LINES;
//   s_command.InstructionDTRMode = HAL_XSPI_INSTRUCTION_DTR_DISABLE;
//   s_command.InstructionWidth = (Mode == MX66UW1G45G_SPI_MODE)
//                                    ? HAL_XSPI_INSTRUCTION_8_BITS
//                                    : HAL_XSPI_INSTRUCTION_16_BITS;
//   s_command.Instruction = (Mode == MX66UW1G45G_SPI_MODE)
//                               ? ((AddressWidth == MX66UW1G45G_3BYTES_SIZE)
//                                      ? MX66UW1G45G_FAST_READ_CMD
//                                      : MX66UW1G45G_4_BYTE_ADDR_FAST_READ_CMD)
//                               : MX66UW1G45G_OCTA_READ_CMD;
//   s_command.AddressMode = (Mode == MX66UW1G45G_SPI_MODE)
//                               ? HAL_XSPI_ADDRESS_1_LINE
//                               : HAL_XSPI_ADDRESS_8_LINES;
//   s_command.AddressDTRMode = HAL_XSPI_ADDRESS_DTR_DISABLE;
//   s_command.AddressWidth = (AddressWidth == MX66UW1G45G_3BYTES_SIZE)
//                                ? HAL_XSPI_ADDRESS_24_BITS
//                                : HAL_XSPI_ADDRESS_32_BITS;
//   s_command.Address = ReadAddr;
//   s_command.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
//   s_command.DataMode = (Mode == MX66UW1G45G_SPI_MODE) ? HAL_XSPI_DATA_1_LINE : HAL_XSPI_DATA_8_LINES;
//   s_command.DataDTRMode = HAL_XSPI_DATA_DTR_DISABLE;
//   s_command.DummyCycles = (Mode == MX66UW1G45G_SPI_MODE) ? DUMMY_CYCLES_READ : DUMMY_CYCLES_READ_OCTAL;
//   s_command.DataLength = Size;
//   s_command.DQSMode = HAL_XSPI_DQS_DISABLE;
//  #if defined (XSPI_CCR_SIOO)
//   s_command.SIOOMode            = HAL_XSPI_SIOO_INST_EVERY_CMD;
//  #endif

//   /* Send the command */
//   if (HAL_XSPI_Command(Ctx, &s_command, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   /* Reception of the data */
//   if (HAL_XSPI_Receive(Ctx, pData, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   return MX66UW1G45G_OK;
// }

// /**
//   * @brief  Reads an amount of data from the XSPI memory on DTR mode.
//   *         OPI
//   * @param  Ctx Component object pointer
//   * @param  AddressWidth Address size
//   * @param  pData Pointer to data to be read
//   * @param  ReadAddr Read start address
//   * @param  Size Size of data to read
//   * @note   Only OPI mode support DTR transfer rate
//   * @retval XSPI memory status
//   */
// int32_t MX66UW1G45G_ReadDTR(XSPI_HandleTypeDef *Ctx, uint8_t *pData, uint32_t ReadAddr, uint32_t Size)
// {
//   XSPI_RegularCmdTypeDef s_command = {0};

//   /* Initialize the read command */
//   s_command.OperationType = HAL_XSPI_OPTYPE_COMMON_CFG;
//   s_command.InstructionMode = HAL_XSPI_INSTRUCTION_8_LINES;
//   s_command.InstructionDTRMode = HAL_XSPI_INSTRUCTION_DTR_ENABLE;
//   s_command.InstructionWidth = HAL_XSPI_INSTRUCTION_16_BITS;
//   s_command.Instruction = MX66UW1G45G_OCTA_READ_DTR_CMD;
//   s_command.AddressMode = HAL_XSPI_ADDRESS_8_LINES;
//   s_command.AddressDTRMode = HAL_XSPI_ADDRESS_DTR_ENABLE;
//   s_command.AddressWidth = HAL_XSPI_ADDRESS_32_BITS;
//   s_command.Address = ReadAddr;
//   s_command.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
//   s_command.DataMode = HAL_XSPI_DATA_8_LINES;
//   s_command.DataDTRMode = HAL_XSPI_DATA_DTR_ENABLE;
//   s_command.DummyCycles = DUMMY_CYCLES_READ_OCTAL_DTR;
//   s_command.DataLength = Size;
//   s_command.DQSMode = HAL_XSPI_DQS_ENABLE;
//  #if defined (XSPI_CCR_SIOO)
//   s_command.SIOOMode            = HAL_XSPI_SIOO_INST_EVERY_CMD;
//  #endif

//   /* Send the command */
//   if (HAL_XSPI_Command(Ctx, &s_command, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   /* Reception of the data */
//   if (HAL_XSPI_Receive(Ctx, pData, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   return MX66UW1G45G_OK;
// }

// /**
//   * @brief  Writes an amount of data to the XSPI memory.
//   *         SPI/OPI
//   * @param  Ctx Component object pointer
//   * @param  Mode Interface mode
//   * @param  AddressWidth Address size
//   * @param  pData Pointer to data to be written
//   * @param  WriteAddr Write start address
//   * @param  Size Size of data to write. Range 1 ~ MX66UW1G45G_PAGE_SIZE
//   * @note   Address size is forced to 3 Bytes when the 4 Bytes address size
//   *         command is not available for the specified interface mode
//   * @retval XSPI memory status
//   */
// int32_t MX66UW1G45G_PageProgram(XSPI_HandleTypeDef *Ctx, MX66UW1G45G_Interface_t Mode,
//                                 MX66UW1G45G_AddressWidth_t AddressWidth, uint8_t *pData, uint32_t WriteAddr,
//                                 uint32_t Size)
// {
//   XSPI_RegularCmdTypeDef s_command = {0};

//   /* OPI mode and 3-bytes address size not supported by memory */
//   if ((Mode == MX66UW1G45G_OPI_MODE) && (AddressWidth == MX66UW1G45G_3BYTES_SIZE))
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   /* Initialize the program command */
//   s_command.OperationType = HAL_XSPI_OPTYPE_COMMON_CFG;
//   s_command.InstructionMode = (Mode == MX66UW1G45G_SPI_MODE)
//                                   ? HAL_XSPI_INSTRUCTION_1_LINE
//                                   : HAL_XSPI_INSTRUCTION_8_LINES;
//   s_command.InstructionDTRMode = HAL_XSPI_INSTRUCTION_DTR_DISABLE;
//   s_command.InstructionWidth = (Mode == MX66UW1G45G_SPI_MODE)
//                                    ? HAL_XSPI_INSTRUCTION_8_BITS
//                                    : HAL_XSPI_INSTRUCTION_16_BITS;
//   s_command.Instruction = (Mode == MX66UW1G45G_SPI_MODE)
//                               ? ((AddressWidth == MX66UW1G45G_3BYTES_SIZE)
//                                      ? MX66UW1G45G_PAGE_PROG_CMD
//                                      : MX66UW1G45G_4_BYTE_PAGE_PROG_CMD)
//                               : MX66UW1G45G_OCTA_PAGE_PROG_CMD;
//   s_command.AddressMode = (Mode == MX66UW1G45G_SPI_MODE)
//                               ? HAL_XSPI_ADDRESS_1_LINE
//                               : HAL_XSPI_ADDRESS_8_LINES;
//   s_command.AddressDTRMode = HAL_XSPI_ADDRESS_DTR_DISABLE;
//   s_command.AddressWidth = (AddressWidth == MX66UW1G45G_3BYTES_SIZE)
//                                ? HAL_XSPI_ADDRESS_24_BITS
//                                : HAL_XSPI_ADDRESS_32_BITS;
//   s_command.Address = WriteAddr;
//   s_command.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
//   s_command.DataMode = (Mode == MX66UW1G45G_SPI_MODE) ? HAL_XSPI_DATA_1_LINE : HAL_XSPI_DATA_8_LINES;
//   s_command.DataDTRMode = HAL_XSPI_DATA_DTR_DISABLE;
//   s_command.DummyCycles = 0U;
//   s_command.DataLength = Size;
//   s_command.DQSMode = HAL_XSPI_DQS_DISABLE;
//  #if defined (XSPI_CCR_SIOO)
//   s_command.SIOOMode            = HAL_XSPI_SIOO_INST_EVERY_CMD;
//  #endif

//   /* Configure the command */
//   if (HAL_XSPI_Command(Ctx, &s_command, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   /* Transmission of the data */
//   if (HAL_XSPI_Transmit(Ctx, pData, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   return MX66UW1G45G_OK;
// }

