williams-one/stm32-lvgl-c/hal_is25lp032d/is25lp032d.c
// /**
//   * @brief  Writes an amount of data to the XSPI memory on DTR mode.
//   *         SPI/OPI
//   * @param  Ctx Component object pointer
//   * @param  pData Pointer to data to be written
//   * @param  WriteAddr Write start address
//   * @param  Size Size of data to write. Range 1 ~ MX66UW1G45G_PAGE_SIZE
//   * @note   Only OPI mode support DTR transfer rate
//   * @retval XSPI memory status
//   */
// int32_t MX66UW1G45G_PageProgramDTR(XSPI_HandleTypeDef *Ctx, uint8_t *pData, uint32_t WriteAddr, uint32_t Size)
// {
//   XSPI_RegularCmdTypeDef s_command = {0};

//   /* Initialize the program command */
//   s_command.OperationType = HAL_XSPI_OPTYPE_COMMON_CFG;
//   s_command.InstructionMode = HAL_XSPI_INSTRUCTION_8_LINES;
//   s_command.InstructionDTRMode = HAL_XSPI_INSTRUCTION_DTR_ENABLE;
//   s_command.InstructionWidth = HAL_XSPI_INSTRUCTION_16_BITS;
//   s_command.Instruction = MX66UW1G45G_OCTA_PAGE_PROG_CMD;
//   s_command.AddressMode = HAL_XSPI_ADDRESS_8_LINES;
//   s_command.AddressDTRMode = HAL_XSPI_ADDRESS_DTR_ENABLE;
//   s_command.AddressWidth = HAL_XSPI_ADDRESS_32_BITS;
//   s_command.Address = WriteAddr;
//   s_command.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
//   s_command.DataMode = HAL_XSPI_DATA_8_LINES;
//   s_command.DataDTRMode = HAL_XSPI_DATA_DTR_ENABLE;
//   s_command.DummyCycles = 0U;
//   s_command.DataLength = Size;
//   s_command.DQSMode = HAL_XSPI_DQS_DISABLE;
//  #if defined (XSPI_CCR_SIOO)
//   s_command.SIOOMode            = HAL_XSPI_SIOO_INST_EVERY_CMD;
//  #endif

//   /* Configure the command */
//   if (HAL_XSPI_Command(Ctx, &s_command, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   /* Transmission of the data */
//   if (HAL_XSPI_Transmit(Ctx, pData, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   return MX66UW1G45G_OK;
// }

// /**
//   * @brief  Erases the specified block of the XSPI memory.
//   *         MX66UW1G45G support 4K, 64K size block erase commands.
//   *         SPI/OPI; 1-1-1/8-8-8
//   * @param  Ctx Component object pointer
//   * @param  Mode Interface mode
//   * @param  AddressWidth Address size
//   * @param  BlockAddress Block address to erase
//   * @param  BlockSize Block size to erase
//   * @retval XSPI memory status
//   */

// int32_t MX66UW1G45G_BlockErase(XSPI_HandleTypeDef *Ctx, MX66UW1G45G_Interface_t Mode, MX66UW1G45G_Transfer_t Rate,
//                                MX66UW1G45G_AddressWidth_t AddressWidth, uint32_t BlockAddress,
//                                MX66UW1G45G_Erase_t BlockSize)
// {

//   XSPI_RegularCmdTypeDef s_command = {0};

//   /* SPI mode and DTR transfer not supported by memory */
//   if ((Mode == MX66UW1G45G_SPI_MODE) && (Rate == MX66UW1G45G_DTR_TRANSFER))
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   /* Initialize the erase command */
//   s_command.OperationType      = HAL_XSPI_OPTYPE_COMMON_CFG;
//   s_command.IOSelect           = HAL_XSPI_SELECT_IO_7_0;
//   s_command.InstructionMode    = (Mode == MX66UW1G45G_SPI_MODE)
//                                  ? HAL_XSPI_INSTRUCTION_1_LINE
//                                  : HAL_XSPI_INSTRUCTION_8_LINES;
//   s_command.InstructionDTRMode = (Rate == MX66UW1G45G_DTR_TRANSFER)
//                                  ? HAL_XSPI_INSTRUCTION_DTR_ENABLE
//                                  : HAL_XSPI_INSTRUCTION_DTR_DISABLE;
//   s_command.InstructionWidth   = (Mode == MX66UW1G45G_SPI_MODE)
//                                  ? HAL_XSPI_INSTRUCTION_8_BITS
//                                  : HAL_XSPI_INSTRUCTION_16_BITS;
//   s_command.AddressMode        = (Mode == MX66UW1G45G_SPI_MODE) ? HAL_XSPI_ADDRESS_1_LINE : HAL_XSPI_ADDRESS_8_LINES;
//   s_command.AddressDTRMode     = (Rate == MX66UW1G45G_DTR_TRANSFER)
//                                  ? HAL_XSPI_ADDRESS_DTR_ENABLE
//                                  : HAL_XSPI_ADDRESS_DTR_DISABLE;
//   s_command.AddressWidth       = (AddressWidth == MX66UW1G45G_3BYTES_SIZE)
//                                  ? HAL_XSPI_ADDRESS_24_BITS
//                                  : HAL_XSPI_ADDRESS_32_BITS;
//   s_command.Address            = BlockAddress;
//   s_command.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
//   s_command.DataMode           = HAL_XSPI_DATA_NONE;
//   s_command.DummyCycles        = 0U;
//   s_command.DQSMode            = HAL_XSPI_DQS_DISABLE;
//  #if defined (XSPI_CCR_SIOO)
//   s_command.SIOOMode            = HAL_XSPI_SIOO_INST_EVERY_CMD;
//  #endif

//   switch (Mode)
//   {
//     case MX66UW1G45G_OPI_MODE :
//       if (BlockSize == MX66UW1G45G_ERASE_64K)
//       {
//         s_command.Instruction = MX66UW1G45G_OCTA_BLOCK_ERASE_64K_CMD;
//       }
//       else
//       {
//         s_command.Instruction = MX66UW1G45G_OCTA_SECTOR_ERASE_4K_CMD;
//       }
//       break;

//     case MX66UW1G45G_SPI_MODE :
//     default:
//       if (BlockSize == MX66UW1G45G_ERASE_64K)
//       {
//         s_command.Instruction = (AddressWidth == MX66UW1G45G_3BYTES_SIZE)
//                                 ? MX66UW1G45G_BLOCK_ERASE_64K_CMD
//                                 : MX66UW1G45G_4_BYTE_BLOCK_ERASE_64K_CMD;
//       }
//       else
//       {
//         s_command.Instruction = (AddressWidth == MX66UW1G45G_3BYTES_SIZE)
//                                 ? MX66UW1G45G_SECTOR_ERASE_4K_CMD
//                                 : MX66UW1G45G_4_BYTE_SECTOR_ERASE_4K_CMD;
//       }
//       break;
//   }

//   if (HAL_XSPI_Command(Ctx, &s_command, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//   {
//     return MX66UW1G45G_ERROR;
//   }


//   return MX66UW1G45G_OK;
// }

// /**
//   * @brief  Whole chip erase.
//   *         SPI/OPI; 1-0-0/8-0-0
//   * @param  Ctx Component object pointer
//   * @param  Mode Interface mode
//   * @retval error status
//   */
// int32_t MX66UW1G45G_ChipErase(XSPI_HandleTypeDef *Ctx, MX66UW1G45G_Interface_t Mode, MX66UW1G45G_Transfer_t Rate)
// {
//   XSPI_RegularCmdTypeDef s_command = {0};

//   /* SPI mode and DTR transfer not supported by memory */
//   if ((Mode == MX66UW1G45G_SPI_MODE) && (Rate == MX66UW1G45G_DTR_TRANSFER))
//   {
//     return MX66UW1G45G_ERROR;
//   }

