williams-one/stm32-lvgl-c/hal_is25lp032d/is25lp032d.c
//   /* Initialize the erase command */
//   s_command.OperationType = HAL_XSPI_OPTYPE_COMMON_CFG;
//   s_command.InstructionMode = (Mode == MX66UW1G45G_SPI_MODE)
//                                   ? HAL_XSPI_INSTRUCTION_1_LINE
//                                   : HAL_XSPI_INSTRUCTION_8_LINES;
//   s_command.InstructionDTRMode = (Rate == MX66UW1G45G_DTR_TRANSFER)
//                                      ? HAL_XSPI_INSTRUCTION_DTR_ENABLE
//                                      : HAL_XSPI_INSTRUCTION_DTR_DISABLE;
//   s_command.InstructionWidth = (Mode == MX66UW1G45G_SPI_MODE)
//                                    ? HAL_XSPI_INSTRUCTION_8_BITS
//                                    : HAL_XSPI_INSTRUCTION_16_BITS;
//   s_command.Instruction = (Mode == MX66UW1G45G_SPI_MODE)
//                               ? MX66UW1G45G_BULK_ERASE_CMD
//                               : MX66UW1G45G_OCTA_BULK_ERASE_CMD;
//   s_command.AddressMode = HAL_XSPI_ADDRESS_NONE;
//   s_command.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
//   s_command.DataMode = HAL_XSPI_DATA_NONE;
//   s_command.DummyCycles = 0U;
//   s_command.DQSMode = HAL_XSPI_DQS_DISABLE;
//  #if defined (XSPI_CCR_SIOO)
//   s_command.SIOOMode            = HAL_XSPI_SIOO_INST_EVERY_CMD;
//  #endif

//   /* Send the command */
//   if (HAL_XSPI_Command(Ctx, &s_command, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   return MX66UW1G45G_OK;
// }

// /**
//   * @brief  Enable memory mapped mode for the XSPI memory on STR mode.
//   *         SPI/OPI; 1-1-1/8-8-8
//   * @param  Ctx Component object pointer
//   * @param  Mode Interface mode
//   * @param  AddressWidth Address size
//   * @retval XSPI memory status
//   */
// int32_t MX66UW1G45G_EnableSTRMemoryMappedMode(XSPI_HandleTypeDef *Ctx, MX66UW1G45G_Interface_t Mode,
//                                               MX66UW1G45G_AddressWidth_t AddressWidth)
// {
//   XSPI_RegularCmdTypeDef s_command = {0};
//   XSPI_MemoryMappedTypeDef s_mem_mapped_cfg = {0};

//   /* OPI mode and 3-bytes address size not supported by memory */
//   if ((Mode == MX66UW1G45G_OPI_MODE) && (AddressWidth == MX66UW1G45G_3BYTES_SIZE))
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   /* Initialize the read command */
//   s_command.OperationType = HAL_XSPI_OPTYPE_READ_CFG;
//   s_command.InstructionMode = (Mode == MX66UW1G45G_SPI_MODE)
//                                   ? HAL_XSPI_INSTRUCTION_1_LINE
//                                   : HAL_XSPI_INSTRUCTION_8_LINES;
//   s_command.InstructionDTRMode = HAL_XSPI_INSTRUCTION_DTR_DISABLE;
//   s_command.InstructionWidth = (Mode == MX66UW1G45G_SPI_MODE)
//                                    ? HAL_XSPI_INSTRUCTION_8_BITS
//                                    : HAL_XSPI_INSTRUCTION_16_BITS;
//   s_command.Instruction = (Mode == MX66UW1G45G_SPI_MODE)
//                               ? ((AddressWidth == MX66UW1G45G_3BYTES_SIZE)
//                                      ? MX66UW1G45G_FAST_READ_CMD
//                                      : MX66UW1G45G_4_BYTE_ADDR_FAST_READ_CMD)
//                               : MX66UW1G45G_OCTA_READ_CMD;
//   s_command.AddressMode = (Mode == MX66UW1G45G_SPI_MODE) ? HAL_XSPI_ADDRESS_1_LINE : HAL_XSPI_ADDRESS_8_LINES;
//   s_command.AddressDTRMode = HAL_XSPI_ADDRESS_DTR_DISABLE;
//   s_command.AddressWidth = (AddressWidth == MX66UW1G45G_3BYTES_SIZE)
//                                ? HAL_XSPI_ADDRESS_24_BITS
//                                : HAL_XSPI_ADDRESS_32_BITS;
//   s_command.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
//   s_command.DataMode = (Mode == MX66UW1G45G_SPI_MODE) ? HAL_XSPI_DATA_1_LINE : HAL_XSPI_DATA_8_LINES;
//   s_command.DataDTRMode = HAL_XSPI_DATA_DTR_DISABLE;
//   s_command.DummyCycles = (Mode == MX66UW1G45G_SPI_MODE) ? DUMMY_CYCLES_READ : DUMMY_CYCLES_READ_OCTAL;
//   s_command.DQSMode = HAL_XSPI_DQS_DISABLE;
//  #if defined (XSPI_CCR_SIOO)
//   s_command.SIOOMode            = HAL_XSPI_SIOO_INST_EVERY_CMD;
//  #endif

//   /* Send the read command */
//   if (HAL_XSPI_Command(Ctx, &s_command, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   /* Initialize the program command */
//   s_command.OperationType = HAL_XSPI_OPTYPE_WRITE_CFG;
//   s_command.Instruction = (Mode == MX66UW1G45G_SPI_MODE)
//                               ? ((AddressWidth == MX66UW1G45G_3BYTES_SIZE)
//                                      ? MX66UW1G45G_PAGE_PROG_CMD
//                                      : MX66UW1G45G_4_BYTE_PAGE_PROG_CMD)
//                               : MX66UW1G45G_OCTA_PAGE_PROG_CMD;
//   s_command.DummyCycles = 0U;

//   /* Send the write command */
//   if (HAL_XSPI_Command(Ctx, &s_command, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   /* Configure the memory mapped mode */
//   s_mem_mapped_cfg.TimeOutActivation = HAL_XSPI_TIMEOUT_COUNTER_DISABLE;

//   if (HAL_XSPI_MemoryMapped(Ctx, &s_mem_mapped_cfg) != HAL_OK)
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   return MX66UW1G45G_OK;
// }

// /**
//   * @brief  Enable memory mapped mode for the XSPI memory on DTR mode.
//   * @param  Ctx Component object pointer
//   * @param  Mode Interface mode
//   * @param  AddressWidth Address size
//   * @note   Only OPI mode support DTR transfer rate
//   * @retval XSPI memory status
//   */
// int32_t MX66UW1G45G_EnableDTRMemoryMappedMode(XSPI_HandleTypeDef *Ctx, MX66UW1G45G_Interface_t Mode)
// {
//   /* Prevent unused argument(s) compilation warning */
//   UNUSED(Mode);

//   XSPI_RegularCmdTypeDef s_command = {0};
//   XSPI_MemoryMappedTypeDef s_mem_mapped_cfg = {0};

//   /* Initialize the read command */
//   s_command.OperationType = HAL_XSPI_OPTYPE_READ_CFG;
//   s_command.InstructionMode = HAL_XSPI_INSTRUCTION_8_LINES;
//   s_command.InstructionDTRMode = HAL_XSPI_INSTRUCTION_DTR_ENABLE;
//   s_command.InstructionWidth = HAL_XSPI_INSTRUCTION_16_BITS;
//   s_command.Instruction = MX66UW1G45G_OCTA_READ_DTR_CMD;
//   s_command.AddressMode = HAL_XSPI_ADDRESS_8_LINES;
//   s_command.AddressDTRMode = HAL_XSPI_ADDRESS_DTR_ENABLE;
//   s_command.AddressWidth = HAL_XSPI_ADDRESS_32_BITS;
//   s_command.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
//   s_command.DataMode = HAL_XSPI_DATA_8_LINES;
//   s_command.DataDTRMode = HAL_XSPI_DATA_DTR_ENABLE;
//   s_command.DummyCycles = DUMMY_CYCLES_READ_OCTAL_DTR;
//   s_command.DQSMode = HAL_XSPI_DQS_ENABLE;
//  #if defined (XSPI_CCR_SIOO)
//   s_command.SIOOMode            = HAL_XSPI_SIOO_INST_EVERY_CMD;
//  #endif

