williams-one/stm32-lvgl-c/hal_is25lp032d/is25lp032d.c
//   /* Send the command */
//   if (HAL_XSPI_Command(Ctx, &s_command, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   /* Configure automatic polling mode to wait for write enabling */
//   s_command.Instruction = (Mode == MX66UW1G45G_SPI_MODE)
//                               ? MX66UW1G45G_READ_STATUS_REG_CMD
//                               : MX66UW1G45G_OCTA_READ_STATUS_REG_CMD;
//   s_command.AddressMode = (Mode == MX66UW1G45G_SPI_MODE) ? HAL_XSPI_ADDRESS_NONE : HAL_XSPI_ADDRESS_8_LINES;
//   s_command.AddressDTRMode = (Rate == MX66UW1G45G_DTR_TRANSFER)
//                                  ? HAL_XSPI_ADDRESS_DTR_ENABLE
//                                  : HAL_XSPI_ADDRESS_DTR_DISABLE;
//   s_command.AddressWidth = HAL_XSPI_ADDRESS_32_BITS;
//   s_command.Address = 0U;
//   s_command.DataMode = (Mode == MX66UW1G45G_SPI_MODE) ? HAL_XSPI_DATA_1_LINE : HAL_XSPI_DATA_8_LINES;
//   s_command.DataDTRMode = (Rate == MX66UW1G45G_DTR_TRANSFER) ? HAL_XSPI_DATA_DTR_ENABLE : HAL_XSPI_DATA_DTR_DISABLE;
//   s_command.DummyCycles = (Mode == MX66UW1G45G_SPI_MODE)
//                               ? 0U
//                               : ((Rate == MX66UW1G45G_DTR_TRANSFER)
//                                      ? DUMMY_CYCLES_REG_OCTAL_DTR
//                                      : DUMMY_CYCLES_REG_OCTAL);
//   s_command.DataLength = (Rate == MX66UW1G45G_DTR_TRANSFER) ? 2U : 1U;
//   s_command.DQSMode = (Rate == MX66UW1G45G_DTR_TRANSFER) ? HAL_XSPI_DQS_ENABLE : HAL_XSPI_DQS_DISABLE;

//   /* Send the command */
//   if (HAL_XSPI_Command(Ctx, &s_command, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   s_config.MatchValue = 2U;
//   s_config.MatchMask = 2U;
//   s_config.MatchMode = HAL_XSPI_MATCH_MODE_AND;
//   s_config.IntervalTime = MX66UW1G45G_AUTOPOLLING_INTERVAL_TIME;
//   s_config.AutomaticStop = HAL_XSPI_AUTOMATIC_STOP_ENABLE;

//   if (HAL_XSPI_AutoPolling(Ctx, &s_config, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   return MX66UW1G45G_OK;
// }

// /**
//   * @brief  This function reset the (WEN) Write Enable Latch bit.
//   *         SPI/OPI
//   * @param  Ctx Component object pointer
//   * @param  Mode Interface mode
//   * @param  Rate Transfer rate STR or DTR
//   * @retval error status
//   */
// int32_t MX66UW1G45G_WriteDisable(XSPI_HandleTypeDef *Ctx, MX66UW1G45G_Interface_t Mode, MX66UW1G45G_Transfer_t Rate)
// {
//   XSPI_RegularCmdTypeDef s_command = {0};

//   /* SPI mode and DTR transfer not supported by memory */
//   if ((Mode == MX66UW1G45G_SPI_MODE) && (Rate == MX66UW1G45G_DTR_TRANSFER))
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   /* Initialize the write disable command */
//   s_command.OperationType = HAL_XSPI_OPTYPE_COMMON_CFG;
//   s_command.InstructionMode = (Mode == MX66UW1G45G_SPI_MODE)
//                                   ? HAL_XSPI_INSTRUCTION_1_LINE
//                                   : HAL_XSPI_INSTRUCTION_8_LINES;
//   s_command.InstructionDTRMode = (Rate == MX66UW1G45G_DTR_TRANSFER)
//                                      ? HAL_XSPI_INSTRUCTION_DTR_ENABLE
//                                      : HAL_XSPI_INSTRUCTION_DTR_DISABLE;
//   s_command.InstructionWidth = (Mode == MX66UW1G45G_SPI_MODE)
//                                    ? HAL_XSPI_INSTRUCTION_8_BITS
//                                    : HAL_XSPI_INSTRUCTION_16_BITS;
//   s_command.Instruction = (Mode == MX66UW1G45G_SPI_MODE)
//                               ? MX66UW1G45G_WRITE_DISABLE_CMD
//                               : MX66UW1G45G_OCTA_WRITE_DISABLE_CMD;
//   s_command.AddressMode = HAL_XSPI_ADDRESS_NONE;
//   s_command.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
//   s_command.DataMode = HAL_XSPI_DATA_NONE;
//   s_command.DummyCycles = 0U;
//   s_command.DQSMode = HAL_XSPI_DQS_DISABLE;
//  #if defined (XSPI_CCR_SIOO)
//   s_command.SIOOMode            = HAL_XSPI_SIOO_INST_EVERY_CMD;
//  #endif

//   /* Send the command */
//   if (HAL_XSPI_Command(Ctx, &s_command, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   return MX66UW1G45G_OK;
// }

// /**
//   * @brief  Read Flash Status register value
//   *         SPI/OPI
//   * @param  Ctx Component object pointer
//   * @param  Mode Interface mode
//   * @param  Rate Transfer rate STR or DTR
//   * @param  Value Status register value pointer
//   * @retval error status
//   */
// int32_t MX66UW1G45G_ReadStatusRegister(XSPI_HandleTypeDef *Ctx, MX66UW1G45G_Interface_t Mode,
//                                        MX66UW1G45G_Transfer_t Rate, uint8_t *Value)
// {
//   XSPI_RegularCmdTypeDef s_command = {0};

//   /* SPI mode and DTR transfer not supported by memory */
//   if ((Mode == MX66UW1G45G_SPI_MODE) && (Rate == MX66UW1G45G_DTR_TRANSFER))
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   /* Initialize the reading of status register */
//   s_command.OperationType = HAL_XSPI_OPTYPE_COMMON_CFG;
//   s_command.InstructionMode = (Mode == MX66UW1G45G_SPI_MODE)
//                                   ? HAL_XSPI_INSTRUCTION_1_LINE
//                                   : HAL_XSPI_INSTRUCTION_8_LINES;
//   s_command.InstructionDTRMode = (Rate == MX66UW1G45G_DTR_TRANSFER)
//                                      ? HAL_XSPI_INSTRUCTION_DTR_ENABLE
//                                      : HAL_XSPI_INSTRUCTION_DTR_DISABLE;
//   s_command.InstructionWidth = (Mode == MX66UW1G45G_SPI_MODE)
//                                    ? HAL_XSPI_INSTRUCTION_8_BITS
//                                    : HAL_XSPI_INSTRUCTION_16_BITS;
//   s_command.Instruction = (Mode == MX66UW1G45G_SPI_MODE)
//                               ? MX66UW1G45G_READ_STATUS_REG_CMD
//                               : MX66UW1G45G_OCTA_READ_STATUS_REG_CMD;
//   s_command.AddressMode = (Mode == MX66UW1G45G_SPI_MODE) ? HAL_XSPI_ADDRESS_NONE : HAL_XSPI_ADDRESS_8_LINES;
//   s_command.AddressDTRMode = (Rate == MX66UW1G45G_DTR_TRANSFER)
//                                  ? HAL_XSPI_ADDRESS_DTR_ENABLE
//                                  : HAL_XSPI_ADDRESS_DTR_DISABLE;
//   s_command.AddressWidth = HAL_XSPI_ADDRESS_32_BITS;
//   s_command.Address = 0U;
//   s_command.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
//   s_command.DataMode = (Mode == MX66UW1G45G_SPI_MODE) ? HAL_XSPI_DATA_1_LINE : HAL_XSPI_DATA_8_LINES;
//   s_command.DataDTRMode = (Rate == MX66UW1G45G_DTR_TRANSFER)
//                               ? HAL_XSPI_DATA_DTR_ENABLE
//                               : HAL_XSPI_DATA_DTR_DISABLE;
//   s_command.DummyCycles = (Mode == MX66UW1G45G_SPI_MODE)
//                               ? 0U
//                               : ((Rate == MX66UW1G45G_DTR_TRANSFER)
//                                      ? DUMMY_CYCLES_REG_OCTAL_DTR
//                                      : DUMMY_CYCLES_REG_OCTAL);
//   s_command.DataLength = (Rate == MX66UW1G45G_DTR_TRANSFER) ? 2U : 1U;
//   s_command.DQSMode = (Rate == MX66UW1G45G_DTR_TRANSFER) ? HAL_XSPI_DQS_ENABLE : HAL_XSPI_DQS_DISABLE;
//  #if defined (XSPI_CCR_SIOO)
//   s_command.SIOOMode            = HAL_XSPI_SIOO_INST_EVERY_CMD;
//  #endif

