williams-one/stm32-lvgl-c/hal_is25lp032d/is25lp032d.c
//   /* Initialize the reset enable command */
//   s_command.OperationType = HAL_XSPI_OPTYPE_COMMON_CFG;
//   s_command.IOSelect =  HAL_XSPI_SELECT_IO_3_0;
//   s_command.InstructionMode = (Mode == MX66UW1G45G_SPI_MODE)
//                                   ? HAL_XSPI_INSTRUCTION_1_LINE
//                                   : HAL_XSPI_INSTRUCTION_8_LINES;
//   s_command.InstructionDTRMode = (Rate == MX66UW1G45G_DTR_TRANSFER)
//                                      ? HAL_XSPI_INSTRUCTION_DTR_ENABLE
//                                      : HAL_XSPI_INSTRUCTION_DTR_DISABLE;
//   s_command.InstructionWidth = (Mode == MX66UW1G45G_SPI_MODE)
//                                    ? HAL_XSPI_INSTRUCTION_8_BITS
//                                    : HAL_XSPI_INSTRUCTION_16_BITS;
//   s_command.Instruction = (Mode == MX66UW1G45G_SPI_MODE)
//                               ? MX66UW1G45G_RESET_ENABLE_CMD
//                               : MX66UW1G45G_OCTA_RESET_ENABLE_CMD;
//   s_command.AddressMode = HAL_XSPI_ADDRESS_NONE;
//   s_command.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
//   s_command.DataMode = HAL_XSPI_DATA_NONE;
//   s_command.DummyCycles = 0U;
//   s_command.DQSMode = HAL_XSPI_DQS_DISABLE;


//   /* Send the command */
//   if (HAL_XSPI_Command(Ctx, &s_command, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   return MX66UW1G45G_OK;
// }

// /**
//   * @brief  Flash reset memory command
//   *         SPI/OPI
//   * @param  Ctx Component object pointer
//   * @param  Mode Interface select
//   * @param  Rate Transfer rate STR or DTR
//   * @retval error status
//   */
// int32_t MX66UW1G45G_ResetMemory(XSPI_HandleTypeDef *Ctx, MX66UW1G45G_Interface_t Mode, MX66UW1G45G_Transfer_t Rate)
// {
//   XSPI_RegularCmdTypeDef s_command = {0};

//   /* SPI mode and DTR transfer not supported by memory */
//   if ((Mode == MX66UW1G45G_SPI_MODE) && (Rate == MX66UW1G45G_DTR_TRANSFER))
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   /* Initialize the reset enable command */
//   s_command.OperationType = HAL_XSPI_OPTYPE_COMMON_CFG;
//   s_command.InstructionMode = (Mode == MX66UW1G45G_SPI_MODE)
//                                   ? HAL_XSPI_INSTRUCTION_1_LINE
//                                   : HAL_XSPI_INSTRUCTION_8_LINES;
//   s_command.InstructionDTRMode = (Rate == MX66UW1G45G_DTR_TRANSFER)
//                                      ? HAL_XSPI_INSTRUCTION_DTR_ENABLE
//                                      : HAL_XSPI_INSTRUCTION_DTR_DISABLE;
//   s_command.InstructionWidth = (Mode == MX66UW1G45G_SPI_MODE)
//                                    ? HAL_XSPI_INSTRUCTION_8_BITS
//                                    : HAL_XSPI_INSTRUCTION_16_BITS;
//   s_command.Instruction = (Mode == MX66UW1G45G_SPI_MODE)
//                               ? MX66UW1G45G_RESET_MEMORY_CMD
//                               : MX66UW1G45G_OCTA_RESET_MEMORY_CMD;
//   s_command.AddressMode = HAL_XSPI_ADDRESS_NONE;
//   s_command.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
//   s_command.DataMode = HAL_XSPI_DATA_NONE;
//   s_command.DummyCycles = 0U;
//   s_command.DQSMode = HAL_XSPI_DQS_DISABLE;
//  #if defined (XSPI_CCR_SIOO)
//   s_command.SIOOMode            = HAL_XSPI_SIOO_INST_EVERY_CMD;
//  #endif

//   /* Send the command */
//   if (HAL_XSPI_Command(Ctx, &s_command, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   return MX66UW1G45G_OK;
// }

// /**
//   * @brief  Flash no operation command
//   *         SPI/OPI
//   * @param  Ctx Component object pointer
//   * @param  Mode Interface select
//   * @param  Rate Transfer rate STR or DTR
//   * @retval error status
//   */
// int32_t MX66UW1G45G_NoOperation(XSPI_HandleTypeDef *Ctx, MX66UW1G45G_Interface_t Mode, MX66UW1G45G_Transfer_t Rate)
// {
//   XSPI_RegularCmdTypeDef s_command = {0};

//   /* SPI mode and DTR transfer not supported by memory */
//   if ((Mode == MX66UW1G45G_SPI_MODE) && (Rate == MX66UW1G45G_DTR_TRANSFER))
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   /* Initialize the no operation command */
//   s_command.OperationType = HAL_XSPI_OPTYPE_COMMON_CFG;
//   s_command.InstructionMode = (Mode == MX66UW1G45G_SPI_MODE)
//                                   ? HAL_XSPI_INSTRUCTION_1_LINE
//                                   : HAL_XSPI_INSTRUCTION_8_LINES;
//   s_command.InstructionDTRMode = (Rate == MX66UW1G45G_DTR_TRANSFER)
//                                      ? HAL_XSPI_INSTRUCTION_DTR_ENABLE
//                                      : HAL_XSPI_INSTRUCTION_DTR_DISABLE;
//   s_command.InstructionWidth = (Mode == MX66UW1G45G_SPI_MODE)
//                                    ? HAL_XSPI_INSTRUCTION_8_BITS
//                                    : HAL_XSPI_INSTRUCTION_16_BITS;
//   s_command.Instruction = (Mode == MX66UW1G45G_SPI_MODE) ? MX66UW1G45G_NOP_CMD : MX66UW1G45G_OCTA_NOP_CMD;
//   s_command.AddressMode = HAL_XSPI_ADDRESS_NONE;
//   s_command.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
//   s_command.DataMode = HAL_XSPI_DATA_NONE;
//   s_command.DummyCycles = 0U;
//   s_command.DQSMode = HAL_XSPI_DQS_DISABLE;
//  #if defined (XSPI_CCR_SIOO)
//   s_command.SIOOMode            = HAL_XSPI_SIOO_INST_EVERY_CMD;
//  #endif

//   /* Send the command */
//   if (HAL_XSPI_Command(Ctx, &s_command, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   return MX66UW1G45G_OK;
// }

// /**
//   * @brief  Flash enter deep power-down command
//   *         SPI/OPI
//   * @param  Ctx Component object pointer
//   * @param  Mode Interface select
//   * @param  Rate Transfer rate STR or DTR
//   * @retval error status
//   */
// int32_t MX66UW1G45G_EnterPowerDown(XSPI_HandleTypeDef *Ctx, MX66UW1G45G_Interface_t Mode,
//                                    MX66UW1G45G_Transfer_t Rate)
// {
//   XSPI_RegularCmdTypeDef s_command = {0};

//   /* SPI mode and DTR transfer not supported by memory */
//   if ((Mode == MX66UW1G45G_SPI_MODE) && (Rate == MX66UW1G45G_DTR_TRANSFER))
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   /* Initialize the enter power down command */
//   s_command.OperationType = HAL_XSPI_OPTYPE_COMMON_CFG;

