williams-one/stm32-lvgl-c/hal_is25lp032d/is25lp032d.c
//   s_command.InstructionMode = (Mode == MX66UW1G45G_SPI_MODE)
//                                   ? HAL_XSPI_INSTRUCTION_1_LINE
//                                   : HAL_XSPI_INSTRUCTION_8_LINES;
//   s_command.InstructionDTRMode = (Rate == MX66UW1G45G_DTR_TRANSFER)
//                                      ? HAL_XSPI_INSTRUCTION_DTR_ENABLE
//                                      : HAL_XSPI_INSTRUCTION_DTR_DISABLE;
//   s_command.InstructionWidth = (Mode == MX66UW1G45G_SPI_MODE)
//                                    ? HAL_XSPI_INSTRUCTION_8_BITS
//                                    : HAL_XSPI_INSTRUCTION_16_BITS;
//   s_command.Instruction = (Mode == MX66UW1G45G_SPI_MODE)
//                               ? MX66UW1G45G_ENTER_DEEP_POWER_DOWN_CMD
//                               : MX66UW1G45G_OCTA_ENTER_DEEP_POWER_DOWN_CMD;
//   s_command.AddressMode = HAL_XSPI_ADDRESS_NONE;
//   s_command.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
//   s_command.DataMode = HAL_XSPI_DATA_NONE;
//   s_command.DummyCycles = 0U;
//   s_command.DQSMode = HAL_XSPI_DQS_DISABLE;
//  #if defined (XSPI_CCR_SIOO)
//   s_command.SIOOMode            = HAL_XSPI_SIOO_INST_EVERY_CMD;
//  #endif

//   /* Send the command */
//   if (HAL_XSPI_Command(Ctx, &s_command, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
//   {
//     return MX66UW1G45G_ERROR;
//   }

//   return MX66UW1G45G_OK;
// }

// /**
//   * @}
//   */

// /**
//   * @}
//   */

// /**
//   * @}
//   */

// /**
//   * @}
//   */



#include "is25lp032d.h"
#include "stm32u5xx_hal.h"

extern OSPI_HandleTypeDef hospi1;

/**
  * @brief	perform chip reset
  * @param	none
  * @retval	OK, ERROR
  */
int32_t IS25LP032D_ResetChip(void)
{
	OSPI_RegularCmdTypeDef s_command = {0};
	uint32_t temp = 0;
	/* Erasing Sequence -------------------------------------------------- */
	s_command.OperationType      = HAL_OSPI_OPTYPE_COMMON_CFG;
	s_command.FlashId            = HAL_OSPI_FLASH_ID_1;
	s_command.InstructionMode    = HAL_OSPI_INSTRUCTION_1_LINE;
	s_command.InstructionDtrMode = HAL_OSPI_INSTRUCTION_DTR_DISABLE;
	s_command.InstructionSize    = HAL_OSPI_INSTRUCTION_8_BITS;
	s_command.Instruction        = IS25LP032D_RESET_ENABLE_CMD;
	s_command.AddressMode        = HAL_OSPI_ADDRESS_NONE;
	s_command.AlternateBytesMode = HAL_OSPI_ALTERNATE_BYTES_NONE;
	s_command.DataMode           = HAL_OSPI_DATA_NONE;
	s_command.DummyCycles        = 0U;
	s_command.DQSMode            = HAL_OSPI_DQS_DISABLE;
	s_command.SIOOMode           = HAL_OSPI_SIOO_INST_EVERY_CMD;

	/* Send the command */
	if (HAL_OSPI_Command(&hospi1, &s_command, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
	{
		return HAL_ERROR;
	}
	for (temp = 0; temp < 0x2f; temp++) {
		__NOP();
	}

	s_command.OperationType      = HAL_OSPI_OPTYPE_COMMON_CFG;
	s_command.FlashId            = HAL_OSPI_FLASH_ID_1;
	s_command.InstructionMode    = HAL_OSPI_INSTRUCTION_1_LINE;
	s_command.InstructionDtrMode = HAL_OSPI_INSTRUCTION_DTR_DISABLE;
	s_command.InstructionSize    = HAL_OSPI_INSTRUCTION_8_BITS;
	s_command.Instruction        = IS25LP032D_RESET_EXECUTE_CMD;
	s_command.AddressMode        = HAL_OSPI_ADDRESS_NONE;
	s_command.AlternateBytesMode = HAL_OSPI_ALTERNATE_BYTES_NONE;
	s_command.DataMode           = HAL_OSPI_DATA_NONE;
	s_command.DummyCycles        = 0U;
	s_command.DQSMode            = HAL_OSPI_DQS_DISABLE;
	s_command.SIOOMode           = HAL_OSPI_SIOO_INST_EVERY_CMD;

	/* Send the command */
	if (HAL_OSPI_Command(&hospi1, &s_command, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
	{
		return HAL_ERROR;
	}



	s_command.OperationType      = HAL_OSPI_OPTYPE_COMMON_CFG;
	s_command.FlashId            = HAL_OSPI_FLASH_ID_1;
	s_command.InstructionMode    = HAL_OSPI_INSTRUCTION_1_LINE;
	s_command.InstructionDtrMode = HAL_OSPI_INSTRUCTION_DTR_DISABLE;
	s_command.InstructionSize    = HAL_OSPI_INSTRUCTION_8_BITS;
	s_command.Instruction        = IS25LP032D_RESET_ENABLE_CMD;
	s_command.AddressMode        = HAL_OSPI_ADDRESS_NONE;
	s_command.AlternateBytesMode = HAL_OSPI_ALTERNATE_BYTES_NONE;
	s_command.DataMode           = HAL_OSPI_DATA_NONE;
	s_command.DummyCycles        = 0U;
	s_command.DQSMode            = HAL_OSPI_DQS_DISABLE;
	s_command.SIOOMode           = HAL_OSPI_SIOO_INST_EVERY_CMD;

	/* Send the command */
	if (HAL_OSPI_Command(&hospi1, &s_command, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
	{
		return HAL_ERROR;
	}
	for (temp = 0; temp < 0x2f; temp++) {
		__NOP();
	}

	s_command.OperationType      = HAL_OSPI_OPTYPE_COMMON_CFG;
	s_command.FlashId            = HAL_OSPI_FLASH_ID_1;
	s_command.InstructionMode    = HAL_OSPI_INSTRUCTION_1_LINE;
	s_command.InstructionDtrMode = HAL_OSPI_INSTRUCTION_DTR_DISABLE;
	s_command.InstructionSize    = HAL_OSPI_INSTRUCTION_8_BITS;
	s_command.Instruction        = IS25LP032D_RESET_EXECUTE_CMD;
	s_command.AddressMode        = HAL_OSPI_ADDRESS_NONE;
	s_command.AlternateBytesMode = HAL_OSPI_ALTERNATE_BYTES_NONE;
	s_command.DataMode           = HAL_OSPI_DATA_NONE;
	s_command.DummyCycles        = 0U;
	s_command.DQSMode            = HAL_OSPI_DQS_DISABLE;
	s_command.SIOOMode           = HAL_OSPI_SIOO_INST_EVERY_CMD;

	/* Send the command */
	if (HAL_OSPI_Command(&hospi1, &s_command, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
	{
		return HAL_ERROR;
	}



	s_command.OperationType      = HAL_OSPI_OPTYPE_COMMON_CFG;
	s_command.FlashId            = HAL_OSPI_FLASH_ID_1;
	s_command.InstructionMode    = HAL_OSPI_INSTRUCTION_1_LINE;
	s_command.InstructionDtrMode = HAL_OSPI_INSTRUCTION_DTR_DISABLE;
	s_command.InstructionSize    = HAL_OSPI_INSTRUCTION_8_BITS;
	s_command.Instruction        = IS25LP032D_RESET_ENABLE_CMD;
	s_command.AddressMode        = HAL_OSPI_ADDRESS_NONE;
	s_command.AlternateBytesMode = HAL_OSPI_ALTERNATE_BYTES_NONE;
	s_command.DataMode           = HAL_OSPI_DATA_NONE;
	s_command.DummyCycles        = 0U;
	s_command.DQSMode            = HAL_OSPI_DQS_DISABLE;
	s_command.SIOOMode           = HAL_OSPI_SIOO_INST_EVERY_CMD;

	/* Send the command */
	if (HAL_OSPI_Command(&hospi1, &s_command, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
	{
		return HAL_ERROR;
	}
	for (temp = 0; temp < 0x2f; temp++) {
		__NOP();
	}

	s_command.OperationType      = HAL_OSPI_OPTYPE_COMMON_CFG;
	s_command.FlashId            = HAL_OSPI_FLASH_ID_1;
	s_command.InstructionMode    = HAL_OSPI_INSTRUCTION_1_LINE;
	s_command.InstructionDtrMode = HAL_OSPI_INSTRUCTION_DTR_DISABLE;
	s_command.InstructionSize    = HAL_OSPI_INSTRUCTION_8_BITS;
	s_command.Instruction        = IS25LP032D_RESET_EXECUTE_CMD;
	s_command.AddressMode        = HAL_OSPI_ADDRESS_NONE;
	s_command.AlternateBytesMode = HAL_OSPI_ALTERNATE_BYTES_NONE;
	s_command.DataMode           = HAL_OSPI_DATA_NONE;
	s_command.DummyCycles        = 0U;
	s_command.DQSMode            = HAL_OSPI_DQS_DISABLE;
	s_command.SIOOMode           = HAL_OSPI_SIOO_INST_EVERY_CMD;

