williams-one/stm32-lvgl-c/hal_is25lp032d/is25lp032d.c
  if (HAL_OSPI_MemoryMapped(&hospi1, &s_mem_mapped_cfg) != HAL_OK)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}



int32_t IS25LP032D_WriteEnable(void)
{
  OSPI_RegularCmdTypeDef 	s_command = {0};
  OSPI_AutoPollingTypeDef 	s_config = {0};

  /* Initialize the write enable command */
  s_command.OperationType      = HAL_OSPI_OPTYPE_COMMON_CFG;
  s_command.FlashId            = HAL_OSPI_FLASH_ID_1;
  s_command.InstructionMode    = HAL_OSPI_INSTRUCTION_1_LINE;
  s_command.InstructionDtrMode = HAL_OSPI_INSTRUCTION_DTR_DISABLE;
  s_command.InstructionSize    = HAL_OSPI_INSTRUCTION_8_BITS;
  s_command.Instruction        = IS25LP032D_WRITE_ENABLE_CMD;
  s_command.AddressMode        = HAL_OSPI_ADDRESS_NONE;
  s_command.AlternateBytesMode = HAL_OSPI_ALTERNATE_BYTES_NONE;
  s_command.DataMode           = HAL_OSPI_DATA_NONE;
  s_command.DummyCycles        = 0U;
  s_command.DQSMode            = HAL_OSPI_DQS_DISABLE;
  s_command.SIOOMode           = HAL_OSPI_SIOO_INST_EVERY_CMD;

  /* Send the command */
  if (HAL_OSPI_Command(&hospi1, &s_command, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Configure automatic polling mode to wait for write enabling */
  s_command.Instruction    = IS25LP032D_READ_STATUS_REG_CMD;
  s_command.AddressMode    = HAL_OSPI_ADDRESS_NONE;
  s_command.AddressDtrMode = HAL_OSPI_ADDRESS_DTR_DISABLE;
  s_command.AddressSize    = HAL_OSPI_ADDRESS_32_BITS;
  s_command.Address        = 0U;
  s_command.DataMode       = HAL_OSPI_DATA_1_LINE;
  s_command.DataDtrMode    = HAL_OSPI_DATA_DTR_DISABLE;
  s_command.DummyCycles    = 0U;
  s_command.NbData         = 1U;
  s_command.DQSMode        = HAL_OSPI_DQS_DISABLE;

  /* Send the command */
  if (HAL_OSPI_Command(&hospi1, &s_command, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  s_config.Match           = 2U;
  s_config.Mask            = 2U;
  s_config.MatchMode       = HAL_OSPI_MATCH_MODE_AND;
  s_config.Interval        = HAL_OSPI_TIMEOUT_DEFAULT_VALUE;
  s_config.AutomaticStop   = HAL_OSPI_AUTOMATIC_STOP_ENABLE;

  if (HAL_OSPI_AutoPolling(&hospi1, &s_config, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}
